insert into bloguser (user_id,isactive, password, role, username)
values (1,'Y','$2a$10$RLML4gxMHiYJCls0WIdfFO9w4cMHUCKAYzhU01Z4JboKjY8H7UT5G', 'ADMIN', 'admin');

insert into bloguser (user_id,isactive, password, role, username)
values (2,'Y','$2a$10$RLML4gxMHiYJCls0WIdfFO9w4cMHUCKAYzhU01Z4JboKjY8H7UT5G', 'USER', 'blogUser');

insert into blog (blog_id,createat, details, isactive, title, updateat, username )
values (1,'07-05-2022', 'Программирование — это процесс и искусство создания компьютерных программ. Сюда входят написание кода и сценария, составление алгоритма, разработка программного обеспечения, вёрстка, дизайн и многое другое. Основа программирования — специальные языки, на которых записываются исходные тексты программ.К 2020 году программирование настолько глубоко вошло в быт, что люди перестали замечать, как изменилась жизнь. Сотни тысяч привычных вещей не существовали бы без программирования или были бы гораздо менее удобными в использовании. Привычные бытовые приборы: микроволновая печь, стиральная машина — работают благодаря заложенным в них программам.
Всего 50 лет назад невозможно было представить, как легко будет найти любую необходимую информацию, насколько экономнее станет использоваться время, затрачиваемое на решение некоторых задач.
Поначалу для каждого крохотного действия приходилось создавать программу с нуля. Сейчас же программ написано такое множество, что в их разнообразии трудно ориентироваться. Например, чтобы смонтировать клип, придётся потратить часы на изучение существующих видеоредакторов и выбор подходящего.
Наше время диктует новые условия буквально в каждой области деятельности. Если компания хочет облегчить жизнь себе и своим клиентам, обойти конкурентов, то будет внедрять компьютерные технологии. Музыкальная индустрия и кино, мультипликация и игры, мобильная связь, банковское дело, дизайн и журналистика — все области тесно переплетены с программированием и используют специальные программы на разных этапах работы.Изучение языков
программирования открывает новые возможности и перспективы для каждого человека. Развитие навыков поможет найти работу мечты в каждой стране мира или же работать удалённо.
Работа программиста высоко оплачивается и будет востребована ещё много лет. Бюро статистики труда прогнозирует к 2026 году 30-процентный рост занятости в области разработки программного обеспечения. Некоторые компании охотно берут способных новичков, в других требуется опыт работы или сертификат об окончании обучения.
Обучение программированию не проблема в нынешних реалиях. Существуют обучающие программы, интенсивы, онлайн-курсы, которые помогут новичку легко вникнуть в суть, и с нуля изучить программирование до того уровня, который позволит работать в интересующей компании.',
        'Y', 'Роль программирования в современном мире', '', 'blogUser');

insert into blog (blog_id,createat, details, isactive, title, updateat, username)
values (2,'08-05-2022','На ночном небе количество видимых объектов при идеальных условиях и в отсутствие Луны составляет около 6000. В основном то, что мы видим это звёзды и лишь малая доля это планеты, которых по количеству крайне мало и появляется вопрос: как их отличить от звёзд на ночном небе? Есть несколько способов, с каждым разберёмся по отдельности.
Во-первых, с довольно большой точностью можно сказать, что все планеты движутся в одной плоскости с Землёй вокруг Солнца, если на это смотреть с Земли, то Солнце движется по эклиптике - условной прямой по которой она движется в течение всего года. На этой линии эклиптики расположены 13 созвездий, которые известны, как зодиакальные и их список знают многие. С учётом того, что планеты движутся в одной плоскости, то со стороны наблюдателя с Земли они движутся в области эклиптики и находятся в зодиакальных созвездиях. Поэтому, раз уж хотите найти планеты ночью, то изучите как выглядят основные созвездия и ищите там.Другой метод, менее эффективен, но о нём стоит упомянуть. Звёзды находятся на расстояниях в миллиарды раз больше чем планеты из нашей системы, поэтому их движение на ночном небе незаметно. На самом деле, когда мы всматриваемся ночью на звёзды, то движется грубо говоря само ночное небо, движется оно для нас, но в действительности это вращение Земли вокруг своей оси. Но если наблюдать, допустим, неделю, то звёзды своего положения не меняют относительно других тел, а планеты изменят своё положение, что и отличает их от других. Такой метод был бы эффективен лет так 1000 назад, и есть способ узнать все намного быстрее.
Главная и основная отличительная черта это то, что звёзды мерцают, то бишь меняют яркость на долю секунды или затемняются в одном месте а стают ярче в другом. С планетами такого нет. Важный вопрос: почему? Всё дело в расстоянии: то расстояние, которое проходит световой луч от звезды до нас охватывает намного меньшую площадь, а у планеты намного больше. Когда луч проходит через атмосферу, он преломляется и искажает своё первоначальное направление. Поэтому звёзды из-за неоднородности нашей атмосферы постоянно могут менять свою яркость, сами по себе они стабильны, кроме некоторых видов. У планет, даже если атмосфера преломляет поток лучей, который не попадает на глаз, компенсируется другими лучами света. Ведь в телескопе, смотря на планету, мы видим чёткий диск, и каждая точка диска отбивает часть света, а звезда в телескопе так и остаётся точкой или мизерным набором точек. '',
        ', 'Y', 'Как на ночном небе отличить планеты от звёзд?', '', 'admin');


INSERT INTO comment( comment_id, blog_id, description, username)
VALUES (1, 1, 'круто!', 'blogUser');
INSERT INTO comment( comment_id, blog_id, description, username)
VALUES (2, 2, 'круто!', 'admin');
INSERT INTO comment( comment_id, blog_id, description, username)
VALUES (3, 1, 'cool !!!!!!!!!!!!', 'admin');
INSERT INTO comment( comment_id, blog_id, description, username)
VALUES (4, 2, 'nice', 'blogUser');

